Revit 2027 API
ParameterTypeId.RebarGeometryType Property
 "Geometry"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarGeometryType { get; }
Public Shared ReadOnly Property RebarGeometryType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarGeometryType {
	ForgeTypeId^ get ();
}
static member RebarGeometryType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace